# User-facing tools are Homebrew-owned. This file installs missing entries but
# is never used for automatic cleanup.

tap "anomalyco/tap"

brew "anomalyco/tap/opencode"
brew "basedpyright"
brew "bat"
brew "delve"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "glab"
brew "go"
brew "gofumpt"
brew "goimports"
brew "golangci-lint"
brew "gopls"
brew "herdr"
brew "hermes-agent"
brew "jq"
brew "lazygit"
brew "neovim"
brew "node"
brew "ripgrep"
brew "ruff"
brew "sqlite"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "unzip"
brew "uv"
brew "wget"

cask "claude-code"
cask "codex"

uv "debugpy"
